# Алгоритм вычисления значения функции F(n), где n – натуральное число, задан следующими соотношениями:
# F(n) = n*n + 4*n + 3, при n > 25
# F(n) = F(n+1) + 2*F(n+4), при n ≤ 25, кратных 3
# F(n) = F(n+2) + 3*F(n+5), при n ≤ 25, не кратных 3
# Определите количество натуральных значений n из отрезка [1; 1000], для которых сумма цифр значения F(n) равна 24.

def f(n):

    if n > 25:
        return n * n + 4 * n + 3
    if n <= 25 and n % 3 == 0:
        return f(n+1) + 2 * f(n+4)
    if n <= 25 and n % 3 != 0:
        return f(n+2) + 3 * f(n+5)


counter = 0
for n in range(1, 1001):
    chislo = n
    summ = 0
    while n > 0:
        summ += n % 10
        n //= 10
    if summ == 24:
        counter += 1
print(counter)
